package kr.ac.kopo.day04.hw;


/*
	1. 
	
	3개의 정수를 입력 받아 큰 수에서 작은 수 순으로 출력
	
	3개의 정수를 입력하세요 : 12 7 39
	  
	  39 12 7
	
	2. 
	
	 4개의 정수를 입력 받아 가장 큰 수를 출력
	
	 4개 정수 입력 : 12, 6 2 54
	 가장 큰수 : 54
	 
	3.
	 
	 달팽이가 100m 깊이 우물에 빠졌습니다.
	 달팽이는 5M/hour 우물을 기어오릅니다. 
	 올라간 높이가 50M미만 일때는 -1M/hour
	 			50M이상 일때는 -2M/hour
	 			
	 달팽이는 몇시간만에 우물을 탈출할까요?

	[1시간 후] 달팽이가 올라간 총 높이 : 4M
	[2시간 후] 달팽이가 올라간 총 높이 : 8M
	...
	[XX시간 후] 달팽이가 올라간 총 높이 : 100M or 101M or102M
	
	4. 소수 : 1과 자기자신 외에는 약수가 존재하지 않는 양의정수   
	정수를 입력 : 23
	23은 소수입니다
	
	정수를 입력 : 12
	12는 소수가 아닙니다
	
	5. 
	
	2 ~ 100사이의 소수를 출력
	2  3  5  7  11 13  17 ... 97
	------------------------------
	 2  3  5  7  11
	13 17 ...
	
	
	
	6. [배열]
	
	10개의 정수를 입력 받아 다음과 같이 출력하는 코드를 작성
	
	1's 정수 : 12
	2's 정수 : 3
	3's 정수 : 45
	...
	10's 정수 : 55
	
	<짝수>
	12  56  10  8
	짝수 총합 : xxxx
	
	<홀수>
	3  45  7  12  3  55
	홀수의 총합 : xxxx
	
	
	
	
*/

public class HomeWorkMain {

}
